RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dma.c
    return BL_GET_REG_BITS_VAL(BL_RD_REG(DMAChs, DMA_CONTROL), DMA_TRANSFERSIZE);
}

/****************************************************************************/ /**
 * @brief  Get DMA channel busy status
 *
 * @param  dmaId: DMA ID type
 * @param  ch: DMA channel
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type DMA_Channel_Is_Busy(DMA_ID_Type dmaId, uint8_t ch)
{
    /* Get channel register */
    uint32_t DMAChs = DMA_Get_Channel(dmaAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

    return BL_IS_REG_BIT_SET(BL_RD_REG(DMAChs, DMA_CONFIG), DMA_E) == 1 ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  DMA enable
 *
 * @param  dmaId: DMA ID type
 * @param  ch: DMA channel number
 *
 * @return None
 *
*******************************************************************************/
void DMA_Channel_Enable(DMA_ID_Type dmaId, uint8_t ch)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMAChs = DMA_Get_Channel(dmaAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

    tmpVal = BL_RD_REG(DMAChs, DMA_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, DMA_E);
    BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DMA disable
 *
 * @param  dmaId: DMA ID type
 * @param  ch: DMA channel number
 *
 * @return None
 *
*******************************************************************************/
void DMA_Channel_Disable(DMA_ID_Type dmaId, uint8_t ch)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMAChs = DMA_Get_Channel(dmaAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

    tmpVal = BL_RD_REG(DMAChs, DMA_CONFIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DMA_E);
    BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DMA init LLI transfer
 *
 * @param  dmaId: DMA ID type
 * @param  ch: DMA channel number
 * @param  lliCfg: LLI configuration
 *
 * @return None
 *
*******************************************************************************/
void DMA_LLI_Init(DMA_ID_Type dmaId, uint8_t ch, DMA_LLI_Cfg_Type *lliCfg)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMAChs = DMA_Get_Channel(dmaAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));
    CHECK_PARAM(IS_DMA_TRANS_DIR_TYPE(lliCfg->dir));
    CHECK_PARAM(IS_DMA_PERIPH_REQ_TYPE(lliCfg->dstPeriph));
    CHECK_PARAM(IS_DMA_PERIPH_REQ_TYPE(lliCfg->srcPeriph));

    /* Disable clock gate when use DMA0 */
    if (DMA0_ID == dmaId) {
        GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_DMA_0);
    } else if (DMA1_ID == dmaId) {
        GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_DMA_1);
    } else if (DMA2_ID == dmaId) {
        GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_DMA_2);
    }

    tmpVal = BL_RD_REG(DMAChs, DMA_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_FLOWCNTRL, lliCfg->dir);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DSTPERIPHERAL, lliCfg->dstPeriph);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_SRCPERIPHERAL, lliCfg->srcPeriph);
    BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DMA channel update LLI
 *
 * @param  dmaId: DMA ID type
 * @param  ch: DMA channel number
 * @param  LLI: LLI addr
 *
 * @return None
 *
*******************************************************************************/
void DMA_LLI_Update(DMA_ID_Type dmaId, uint8_t ch, uint32_t LLI)
{
    /* Get channel register */
    uint32_t DMAChs = DMA_Get_Channel(dmaAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

    /* Config channel config */
    //BL_WR_REG(DMAChs, DMA_LLI, LLI);
    ARCH_MemCpy4((uint32_t *)(uintptr_t)DMAChs, (uint32_t *)(uintptr_t)LLI, 4);
}

/****************************************************************************/ /**
 * @brief  DMA channel get LLI counter
 *
 * @param  dmaId: DMA ID type
 * @param  ch: DMA channel number
 *
 * @return LLI counter
 *
*******************************************************************************/
uint32_t DMA_LLI_Get_Counter(DMA_ID_Type dmaId, uint8_t ch)
{
    /* Get channel register */
    uint32_t DMAChs = DMA_Get_Channel(dmaAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

    return BL_GET_REG_BITS_VAL(BL_RD_REG(DMAChs, DMA_CONFIG), DMA_LLICOUNTER);
}

/****************************************************************************/ /**
 * @brief  DMA LLI PingPong Structure Start
 *
 * @param  dmaPpStruct: dma pp struct pointer
 * @param  Ping_Transfer_len: ping len
 * @param  Pong_Transfer_len: pong len
 *
 * @return Succrss or not
 *
*******************************************************************************/
BL_Err_Type DMA_LLI_PpStruct_Set_Transfer_Len(DMA_LLI_PP_Struct *dmaPpStruct, uint16_t Ping_Transfer_len, uint16_t Pong_Transfer_len)
{
    struct DMA_Control_Reg dmaCtrlRegVal_temp;

    if (Ping_Transfer_len > 4096 || Pong_Transfer_len > 4096) {
        return ERROR;
    }

    dmaCtrlRegVal_temp = PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PING_INDEX].dmaCtrl;
    dmaCtrlRegVal_temp.TransferSize = Ping_Transfer_len;
    PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PING_INDEX].dmaCtrl = dmaCtrlRegVal_temp;

    dmaCtrlRegVal_temp = PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PONG_INDEX].dmaCtrl;
    dmaCtrlRegVal_temp.TransferSize = Pong_Transfer_len;
    PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PONG_INDEX].dmaCtrl = dmaCtrlRegVal_temp;

    DMA_LLI_Init(dmaPpStruct->dmaId, dmaPpStruct->dmaChan, dmaPpStruct->lliCfg);
    DMA_LLI_Update(dmaPpStruct->dmaId, dmaPpStruct->dmaChan, (uint32_t)(uintptr_t)&PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PING_INDEX]);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DMA LLI Start New Transmit for Ping-Pong Buf
 *
 * @param  dmaPpBuf: DMA LLI Ping-Pong Buf
 *
 * @return None
 *
*******************************************************************************/
void DMA_LLI_PpBuf_Start_New_Transmit(DMA_LLI_PP_Buf *dmaPpBuf)
{
    CPU_Interrupt_Disable_DMA(dmaPpBuf->dmaId);

