RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dma.c
    if (dmaPpBuf->lliListHeader[dmaPpBuf->idleIndex] != NULL) {
        DMA_LLI_Update(dmaPpBuf->dmaId, dmaPpBuf->dmaChan, (uint32_t)(uintptr_t)dmaPpBuf->lliListHeader[dmaPpBuf->idleIndex]);
        DMA_Channel_Enable(dmaPpBuf->dmaId, dmaPpBuf->dmaChan);
        dmaPpBuf->idleIndex = (dmaPpBuf->idleIndex == 0) ? 1 : 0;
    }

    CPU_Interrupt_Enable_DMA(dmaPpBuf->dmaId);
}

/****************************************************************************/ /**
 * @brief  DMA LLI Remove Completed Ping-Pong Buf List
 *
 * @param  dmaPpBuf: DMA LLI Ping-Pong Buf
 *
 * @return Next Ping-Pong Buf List Header
 *
*******************************************************************************/
DMA_LLI_Ctrl_Type *DMA_LLI_PpBuf_Remove_Completed_List(DMA_LLI_PP_Buf *dmaPpBuf)
{
    CPU_Interrupt_Disable_DMA(dmaPpBuf->dmaId);

    dmaPpBuf->lliListHeader[!dmaPpBuf->idleIndex] = NULL;
    CPU_Interrupt_Enable_DMA(dmaPpBuf->dmaId);
    return dmaPpBuf->lliListHeader[!dmaPpBuf->idleIndex];
}

/****************************************************************************/ /**
 * @brief  DMA LLI Append Buf to List
 *
 * @param  dmaPpBuf: DMA LLI Ping-Pong Buf
 * @param  dmaLliList: New LLI Buf to Append
 *
 * @return None
 *
*******************************************************************************/
void DMA_LLI_PpBuf_Append(DMA_LLI_PP_Buf *dmaPpBuf, DMA_LLI_Ctrl_Type *dmaLliList)
{
    DMA_LLI_Ctrl_Type *pLliList = NULL;
    CPU_Interrupt_Disable_DMA(dmaPpBuf->dmaId);

    pLliList = dmaPpBuf->lliListHeader[dmaPpBuf->idleIndex];

    if (pLliList == NULL) {
        dmaLliList->nextLLI = 0;
        dmaLliList->dmaCtrl.I = 1;
        dmaPpBuf->lliListHeader[dmaPpBuf->idleIndex] = dmaLliList;
    } else {
        /*Append to last */
        while (pLliList->nextLLI != 0) {
            pLliList = (DMA_LLI_Ctrl_Type *)(uintptr_t)pLliList->nextLLI;
        }

        pLliList->nextLLI = (uint32_t)(uintptr_t)dmaLliList;
        pLliList->dmaCtrl.I = 0;
        dmaLliList->nextLLI = 0;
        dmaLliList->dmaCtrl.I = 1;
    }

    if (DMA_Channel_Is_Busy(dmaPpBuf->dmaId, dmaPpBuf->dmaChan) == RESET) {
        /* DMA stopped: maybe stop just a few minutes ago(not enter INT due to CPU_Interrupt_Disable)
           or has already stopped before this function is called */
        if (dmaPpBuf->lliListHeader[!dmaPpBuf->idleIndex] == NULL) {
            /* DMA has already stopped before this function is called */
            DMA_LLI_PpBuf_Start_New_Transmit(dmaPpBuf);
        }
    }

    CPU_Interrupt_Enable_DMA(dmaPpBuf->dmaId);
}

/****************************************************************************/ /**
 * @brief  DMA LLi Destroy Ping-Pong Buf
 *
 * @param  dmaPpBuf: DMA LLI Ping-Pong Buf
 *
 * @return None
 *
*******************************************************************************/
void DMA_LLI_PpBuf_Destroy(DMA_LLI_PP_Buf *dmaPpBuf)
{
    /* DMA LLI Disable */
    DMA_Channel_Disable(dmaPpBuf->dmaId, dmaPpBuf->dmaChan);

    if (dmaPpBuf->lliListHeader[0] != NULL && dmaPpBuf->onTransCompleted != NULL) {
        dmaPpBuf->onTransCompleted(dmaPpBuf->lliListHeader[0]);
    }

    dmaPpBuf->lliListHeader[0] = NULL;

    if (dmaPpBuf->lliListHeader[1] != NULL && dmaPpBuf->onTransCompleted != NULL) {
        dmaPpBuf->onTransCompleted(dmaPpBuf->lliListHeader[1]);
    }

    dmaPpBuf->lliListHeader[1] = NULL;
    dmaPpBuf->idleIndex = 0;
}

/****************************************************************************/ /**
 * @brief  Mask/Unmask the DMA interrupt
 *
 * @param  dmaId: DMA ID type
 * @param  ch: DMA channel number
 * @param  intType: Specifies the interrupt type
 * @param  intMask: Enable/Disable Specified interrupt type
 *
 * @return None
 *
*******************************************************************************/
void DMA_IntMask(DMA_ID_Type dmaId, uint8_t ch, DMA_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMAChs = DMA_Get_Channel(dmaAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));
    CHECK_PARAM(IS_DMA_INT_TYPE(intType));

    switch (intType) {
        case DMA_INT_TCOMPLETED:
            if (intMask == UNMASK) {
                /* UNMASK(Enable) this interrupt */
                tmpVal = BL_CLR_REG_BIT(BL_RD_REG(DMAChs, DMA_CONFIG), DMA_ITC);
                BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
                tmpVal = BL_SET_REG_BIT(BL_RD_REG(DMAChs, DMA_CONTROL), DMA_I);
                BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);
            } else {
                /* MASK(Disable) this interrupt */
                tmpVal = BL_SET_REG_BIT(BL_RD_REG(DMAChs, DMA_CONFIG), DMA_ITC);
                BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
                tmpVal = BL_CLR_REG_BIT(BL_RD_REG(DMAChs, DMA_CONTROL), DMA_I);
                BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);
            }

            break;

        case DMA_INT_ERR:
            if (intMask == UNMASK) {
                /* UNMASK(Enable) this interrupt */
                tmpVal = BL_CLR_REG_BIT(BL_RD_REG(DMAChs, DMA_CONFIG), DMA_IE);
                BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
            } else {
                /* MASK(Disable) this interrupt */
                tmpVal = BL_SET_REG_BIT(BL_RD_REG(DMAChs, DMA_CONFIG), DMA_IE);
                BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
            }

            break;

        case DMA_INT_ALL:
            if (intMask == UNMASK) {
                /* UNMASK(Enable) this interrupt */
                tmpVal = BL_RD_REG(DMAChs, DMA_CONFIG);
                tmpVal = BL_CLR_REG_BIT(tmpVal, DMA_ITC);
                tmpVal = BL_CLR_REG_BIT(tmpVal, DMA_IE);
                BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
                tmpVal = BL_RD_REG(DMAChs, DMA_CONTROL);
                tmpVal = BL_SET_REG_BIT(tmpVal, DMA_I);
                BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);
            } else {
                /* MASK(Disable) this interrupt */
                tmpVal = BL_RD_REG(DMAChs, DMA_CONFIG);
                tmpVal = BL_SET_REG_BIT(tmpVal, DMA_ITC);
                tmpVal = BL_SET_REG_BIT(tmpVal, DMA_IE);
                BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
                tmpVal = BL_RD_REG(DMAChs, DMA_CONTROL);
                tmpVal = BL_CLR_REG_BIT(tmpVal, DMA_I);
                BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);
            }

            break;

        default:
            break;
    }
}

/****************************************************************************/ /**
 * @brief  Install DMA interrupt callback function
 *
 * @param  dmaId: DMA ID type
 * @param  dmaChan: DMA Channel type
 * @param  intType: DMA interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA_Int_Callback_Install(DMA_ID_Type dmaId, DMA_Chan_Type dmaChan, DMA_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA_CHAN_TYPE(dmaChan));
    CHECK_PARAM(IS_DMA_INT_TYPE(intType));

    dmaIntCbfArra[dmaId][dmaChan][intType] = cbFun;
}
#endif

/****************************************************************************/ /**
 * @brief  WLSYS DMA0 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA0_ALL_IRQHandler(void)
{
    DMA_IntHandler(DMA0_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  WLSYS DMA1 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA1_ALL_IRQHandler(void)
{
    DMA_IntHandler(DMA1_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  MMSYS DMA channel 0 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA2_INT0_IRQHandler(void)
{
    DMA_IntHandler(DMA2_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  MMSYS DMA channel 1 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA2_INT1_IRQHandler(void)
{
    DMA_IntHandler(DMA2_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  MMSYS DMA channel 2 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA2_INT2_IRQHandler(void)
{
    DMA_IntHandler(DMA2_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  MMSYS DMA channel 3 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA2_INT3_IRQHandler(void)
{
    DMA_IntHandler(DMA2_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  MMSYS DMA channel 4 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA2_INT4_IRQHandler(void)
{
    DMA_IntHandler(DMA2_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  MMSYS DMA channel 5 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA2_INT5_IRQHandler(void)
{
    DMA_IntHandler(DMA2_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  MMSYS DMA channel 6 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA2_INT6_IRQHandler(void)
{
    DMA_IntHandler(DMA2_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  MMSYS DMA channel 7 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA2_INT7_IRQHandler(void)
{
    DMA_IntHandler(DMA2_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  DMA LLI PingPong Structure Initial
 *
 * @param  dmaPpStruct: DMA LLI PingPong Config Parameter
 *
 * @return start success or not
 *
*******************************************************************************/
BL_Err_Type DMA_LLI_PpStruct_Init(DMA_LLI_PP_Struct *dmaPpStruct)
{
    //setup lliList
    dmaPpStruct->dmaCtrlRegVal.I = 1;
    dmaPpStruct->pingpongIndex = 0;

    if (dmaPpStruct->lliCfg->dir == DMA_TRNS_M2P) {
        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PING_INDEX].srcDmaAddr = dmaPpStruct->pingpongBufAddr[0];
        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PING_INDEX].destDmaAddr = dmaPpStruct->operatePeriphAddr;

        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PONG_INDEX].srcDmaAddr = dmaPpStruct->pingpongBufAddr[1];
        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PONG_INDEX].destDmaAddr = dmaPpStruct->operatePeriphAddr;
    } else if (dmaPpStruct->lliCfg->dir == DMA_TRNS_P2M) {
        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PING_INDEX].srcDmaAddr = dmaPpStruct->operatePeriphAddr;
        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PING_INDEX].destDmaAddr = dmaPpStruct->pingpongBufAddr[0];

        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PONG_INDEX].srcDmaAddr = dmaPpStruct->operatePeriphAddr;
        PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PONG_INDEX].destDmaAddr = dmaPpStruct->pingpongBufAddr[1];
    } else {
        return ERROR;
        /*V1.0 version DMA LLI Ping-Pong structure not support P2P & M2M MODE*/
    }

    PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PING_INDEX].nextLLI = (uint32_t)(uintptr_t)&PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PONG_INDEX];
    PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PING_INDEX].dmaCtrl = dmaPpStruct->dmaCtrlRegVal;

    PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PONG_INDEX].nextLLI = (uint32_t)(uintptr_t)&PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PING_INDEX];
    PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PONG_INDEX].dmaCtrl = dmaPpStruct->dmaCtrlRegVal;

    DMA_LLI_Init(dmaPpStruct->dmaId, dmaPpStruct->dmaChan, dmaPpStruct->lliCfg);

    DMA_LLI_Update(dmaPpStruct->dmaId, dmaPpStruct->dmaChan, (uint32_t)(uintptr_t)&PingPongListArra[dmaPpStruct->dmaId][dmaPpStruct->dmaChan][PING_INDEX]);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DMA LLI PingPong Structure Start
 *
 * @param  dmaPpStruct: None
 *
 * @return None
 *
*******************************************************************************/
void DMA_LLI_PpStruct_Start(DMA_LLI_PP_Struct *dmaPpStruct)
{
    DMA_Channel_Enable(dmaPpStruct->dmaId, dmaPpStruct->dmaChan);
}

/****************************************************************************/ /**
 * @brief  DMA LLI PingPong Structure Stop
 *
 * @param  dmaPpStruct: None
 *
 * @return None
 *
*******************************************************************************/
void DMA_LLI_PpStruct_Stop(DMA_LLI_PP_Struct *dmaPpStruct)
{
    DMA_Channel_Disable(dmaPpStruct->dmaId, dmaPpStruct->dmaChan);
}

/*@} end of group DMA_Public_Functions */

/*@} end of group DMA */

/*@} end of group BL808_Peripheral_Driver */
